[
  {
    "deal": {
      "product_description": "One of one. Award winning, rotisserie restored, Light Blue Metallic 1970 Dodge Charger R/T with very rare color combination EB3 paint and two tone B5 and B7 blue bucket seat interior and black vinyl top.  According to the Chrysler Registry Report, this rare Charger RT, is only one of one produced, with its rare options and color combination.  This incredible Mopar muscle car has benefited from an extensive rotisserie restoration, before going on to win both the Boca Ratan Concours d'elegance in 2017 for Best Muscle Car and the Lake Mirror Concours d'Elegance for Best Muscle car in 2018. This 1970 Charger RT is heavily optioned with a 440 c.i. Magnum engine, Pistol Grip 4-speed transmission, power brakes and A33 Track Pac Dana rear axle with 3.54 gears. This investment grade R/T Charger has had a no expense spared restoration, including the undercarriage and trunk, making it a potential show winner wherever it shows. This American Dream Machine Charger RT, is well documented in the Chrysler Registry and by the fender tag, as you would expect from a Mopar of this caliber. Rolling on correct, painted to match steel wheels with poverty caps and Polyglas F60-15 GT white letter tires for that investment grade muscle car appearance.\nOne of one, documented Charger RT in the Chrysler Registry, with these options and rare color combination\nExtensive rotisserie restored RT winning \"Best Muscle Car\" in two Concours d'Elegance shows\nProfessionally painted from top to bottom in EB3 Light Blue Metallic paint with light blue tail stripe\nCorrect R/T emblems, badges, hood and side scoops\nFactory ordered Blue Bumble Bee tape stripe\nBlack vinyl top\nPainted to match steel wheel with poverty caps\nGoodyear Polyglas white letter tire\nRare two tone B5 and B7 Blue, bucket seat and console interior\nOne of only 7% produced with this interior option\nHurst Pistol Grip shifter\nTic-Toc-Tach\nCenter console with woodgrain applique\nFactory AM radio updated with hidden FM and Bluetooth capabilities\nRestored trunk painted in body color\nTrunk mat, Goodyear spare and jack\nShow quality engine compartment\n440ci Magnum V8 engine\n7 blade fan with factory correct 26in radiator\nOne of only 15% produced with 4-speed manual transmission\nPower brakes\nRotisserie restored undercarriage\nHeavy duty big block suspension\nA33 Track Pak with 3.54 geared Dana 60 rear axle",
      "price": 119900.0,
      "url": "http://www.admcars.com/1970-dodge-charger-rt-440-4-spd,-concours-winner-twice-c-1654.htm"
    },
    "estimate": 231025.52214655222,
    "discount": 111125.52214655222
  },
  {
    "deal": {
      "product_description": "Built to burn rubber, Daytona Yellow RS/SS 1969 Camaro convertible with a performance built 454 and a bad attitude and an extensive restoration.   This is not a tired old 54 year old  RS/SS Camaro with 325hp.  This is a performance built Daytona Yellow American Street Beast that will sit you back in the seat with a serious 454 big block under the hood with performance heads, pushing out over 450 horsepower. Shifting is tight with a new Tremec 5-speed transmission, a 12-bolt posit-traction rear end to puts the rubber to the road and 4-wheel slotted power disc brakes to control the power. The new black bucket interior with console is pristine and shows very well.   Rolling on new chrome Turbine styled US Mag wheels and new performance rated radials. This is a true American Dream Machine and would be a great\nDaytona Yellow convertible show car\nExtensive restoration\nRS Hidden headlights\nSS options, hood and and badging,\nBlack SS hockey stripe\nNew black convertible, power top\nUS Mags Rambler turbine styled wheels\nBlack factory bucket interior\nNew black seat covers, door panels and carpet\nCenter console with gauge package\nModern Classic Sound AM/FM stereo\nPerformance built  454ci engine with aluminum heads\n10.25 compression\nComp Cams hydraulic camshaft\nHolly Sniper fuel injection\nAluminum radiator\nTremec TKX 5-speed transmission\nNewer Vintage Air Conditioning\nPower steering\nPower 4-wheel disc brakes with drilled and slotted rotors\nExcellent metal structure\n12 bolt posit-traction rear end with 3.73 gears\nTubular front control arms\nSubframe connectors\nNew Flowmaster dual exhaust\nNew gas tank",
      "price": 89900.0,
      "url": "http://www.admcars.com/1969-chevrolet-camaro-454450hp-5-speed-ps-pb-ac-c-1512.htm"
    },
    "estimate": 117008.28291620538,
    "discount": 27108.282916205382
  },
  {
    "deal": {
      "product_description": "Fresh out of the body shop.  Very correct and original 1967 Camaro, loaded with power options and professionally painted in code correct LL Tahoe Turquoise, new code correct, 760 black bucket seat interior.  This highly optioned American Dream Machine comes with its numbers matching 327 engine, automatic transmission, power steering, power brakes, and original factory AC that appears intact. This exceptional Camaro was previously owned by a doctor for many years and was very well cared for and has excellent original factory metal structure.  This classic Camaro is has SS stripes and badging and is rolling on a Rally rims, new center caps and trim rings and a new set of BFG white letter radials.\nOrignal code- LL Tahoe Turquoise 1967 Camaro\nAll original intact factory metal structure with great panel fitment\nProfessionally painted and color correct\nWhite SS nose stripe and front and rear spoilers\nNew bumpers trim, and  emblems\nNewly refurbished Rally rims\nNew BF Goodrich white letter radials\nNew Black Bucket Interior\nNew carpet and door panels\nImpressive original dash in great shape\nShow quality engine compartment\nOriginal numbers matching 327 V8 engine ME suffix code indicating 210 horsepower with Powerglide automatic transmission\nOriginal air cleaner and new chrome valve covers\nAutomatic transmission\nPower steering\nPower brakes\nRare factory AC\nExtremely original, clean, solid, and intact\n10 bolt with 3.08 gears casting 3894859",
      "price": 49900.0,
      "url": "http://www.admcars.com/1967-chevrolet-camaro-#s-matching-327-auto-ps-pb-ac-c-1441.htm"
    },
    "estimate": 75748.37683690168,
    "discount": 25848.376836901676
  },
  {
    "deal": {
      "product_description": "Striking Electric Blue, 1967 Rally Sport, Pro-Tour Chevrolet Camaro Convertible with RS hidden headlights and an extensive list of custom modifications, making it a one of a kind muscle machine that was built for show and go. Under the hood is a show stopping, chromed out, engine compartment, showcasing a  fuel injected 5.7L LT1 V8 engine, accompanied by a chrome serpentine belt system, nicely optioned with newer chrome AC, chrome power steering,  4-wheel power disc brakes and with a 4-speed 700R4 automatic overdrive transmission to kick this radical Camaro into high gear.  Fully custom two tone gray bucket seat interior with dark gray carbon fiber pattern seat inserts and lots of upgrades; like power windows, Vintage air conditioning, brand new black console with new working Camaro gauges, tach, tilt steering and leather wrapped steering wheel, topped off with a newer black canvas convertible top that fits snug. This Electric Blue Camaro sounds even better than it looks, with an Alpine High-Fi, audio system, Alpine head unit, eight custom Alpine door and back speakers, and serious sound in the trunk with an Alpine sub woofer and JL Audio amplifier. This American street machine gorgeous body line and with 1968 doors with removed wing windows for a more sleek look,  shaved door handles, key locks and fuel filler cap and a killer lowered stance rolling on Riddler 17 inch chrome and newer Continental performance radials and is ready to put the rubber to the road.\nElectric Blue custom built Camaro with RS and performance upgrades\nGorgeous Camaro body with high-end custom paint job\nNewer black canvas convertible top\nShaved door handles and fuel filler cap\nCustom tail lights for that clean look\n1968 doors with removed wing windows for better lines\nCowl induction hood with subtle custom ghost flames\nRally Sport electric hidden headlights\nNewer bumpers front and rear.\nFront and rear spoiler\nRiddler 17 inch chrome wheels\nNewer Continental performance rated radials\nCustom gray and Carbon fiber bucket seat interior\nNew Camaro center console with correct RS gauges\nPower windows\nTilt steering column\nBillet steering wheel\nFactory tach\nHigh- end Alpine Audio sound system,\nEight separate speakers in interior area\nJL Audio amplifier and sub system in trunk\nShow stopping engine compartment painted Electric Blue\nChromed out, Fuel injected 5.7L LT1 V8 engine Casting 10125327 1992\nCustom chrome serpentine pulley system\nChrome Vintage Air Conditioning\nChrome Power steering pump\n4 Wheel power disc brakes,\nBaer slotted disc brakes on the front\n700R4 Automatic overdrive transmission\nNewer ceramic coated headers\nAluminum radiator\nDual electric fans\nSmoothed painted firewall\nChrome alternator\nChrome hood hinges and hood latch\n12-bolt posi-traction rear end with a 3.55 gear\nTubular A-arms\nHeavy duty sway bars front and rear\nSolid clean and intact\nNewer custom stainless gas tank",
      "price": 79900.0,
      "url": "http://www.admcars.com/1967-chevrolet-camaro-electric-blue-5.7l-700r4-ac-ps-pb-c-1645.htm"
    },
    "estimate": 105447.46573907272,
    "discount": 25547.465739072722
  },
  {
    "deal": {
      "product_description": "Fresh out of the Body shop. Gorgeous Cobalt Blue Metallic 1969 Camaro with white side stripes and a fresh built to burn rubber, 496 cubic inch, aluminum head, big block engine rated at over 600 horsepower under the cowl hood, launched by a rare Muncie M-22 Rock Crusher 4-speed and nicely optioned with lots of chrome and a serpentine belt system, power steering and power disc brakes.  This incredible car is very well preserved and was owned by the last owner in Texas for the last 32 years and he believed this Camaro to be a Norwood pre-code car from the factory but is is much stronger now. The car has the original, code 715 medium blue bucket seat interior and console in great shape with very nice original dash and gauges. This bright blue street beast is rolling on new US Mags Chrome Ramblers and performance rated radials to put the rubber to the road.\nFresh out of the body shop\nProfessionally painted in electric Cobalt Blue Metallic\nOriginal 53-code Glacier Blue car\nStructurally beautiful Camaro body with excellent panel fitment\nJeweled in lots of new chrome and stainless\nBright white hockey stripe on the side and 496 emblems\nRolling on US Mags Chrome Rambler wheels\nBrand new performance radials\nNice 715-code Medium Blue bucket console interior\nVery nice well preserved dash\nGreat looking  original gauges in great condition\nCenters console with  Muncie M-22 Rock Crusher 4-speed\nProfessionally built 496 cubic inch big block engine rated at 600 plus horsepower. Less than 1k miles since built\nRare Muncie M-22 Rock Crusher 4-speed rated at 800 foot pounds of torque\nAluminum Heads\nSerpentine Belt system\nTuff-Stuff Chrome power disc brakes system\nChrome power steering\nChrome alternator\nBe Cool aluminum radiator\nNew user and lower tubular A-arms\nNew QA1 coil over shocks\nNew polyurethane bushings\n10-bolt posi rear end with 4.11 rear gears\nNew heavy duty torsion bars to support the big block engine and the power\nFlaming River ignition and turn off\nExcellent metal structure\nNew ceramic coated headers\nHeavy duty Flowmaster exhaust",
      "price": 72900.0,
      "url": "http://www.admcars.com/1969-chevrolet-camaro-496600+hp-4-speed-ps-pb-c-1488.htm"
    },
    "estimate": 94706.49517500446,
    "discount": 21806.495175004457
  }
]